Управление_торговлей.ПБТ/src/Catalogs/ВидыИсследований/ВидыИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыИсследований</name>
  <attributes>
    <name>ПрефиксНумерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаОбразца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьЛаб</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВывода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/Catalogs/ВидыИсследований/ManagerModule.bsl
Функция ПредопределенныйЭлемент(Имя) Экспорт 

	Возврат ПредопреденныеДанныеНаСервере.ПолучитьПредопреденныеДанные("ВидыИсследований", Имя);

КонецФункции // ()

Функция ПолучитьПредопределенныеДанные() Экспорт 

	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений.Колонки.Добавить("Наименование");
	ТаблицаЗначений.Колонки.Добавить("ПрефиксНумерации");
	ТаблицаЗначений.Колонки.Добавить("МассаОбразца");
	ТаблицаЗначений.Колонки.Добавить("Периодичность");       
	ТаблицаЗначений.Колонки.Добавить("ПорядокВывода");       
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Антибиотики"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Микотоксины"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Микробиологические исследования"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Органолептика"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Пестициды"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Радионуклиды"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Статистика"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Токсичность"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Физико-химические исследования"));
	НоваяСтрока = ТаблицаЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("Наименование", "Функциональные свойства"));

	Возврат ТаблицаЗначений;
	
КонецФункции // ()
